artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix_20260330_125208/cases/lumped_solid/0/jellyRoll/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/jellyRoll";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
27144
(
(-0.017388389 -0.1067452 0.01221881)
(-0.0075189963 -0.10748846 0.012235493)
(0.0025265229 -0.10765575 0.012285336)
(0.012521584 -0.10716453 0.012332102)
(0.021959615 -0.10677255 0.01237062)
(-0.047414175 -0.097849947 0.01228084)
(-0.038190875 -0.098687878 0.012288377)
(-0.02777435 -0.0981515 0.012348622)
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           nonuniform List<vector> 
1528
(
(-0.017295905 -0.10690041 0.25003551)
(-0.0074631094 -0.10735892 0.25000184)
(0.0025044047 -0.10747887 0.25000013)
(0.012414426 -0.10711692 0.25000384)
(0.021977789 -0.10690024 0.25001218)
(-0.047297838 -0.09777745 0.25000015)
(-0.038076103 -0.098488647 0.25000961)
(-0.027650763 -0.097868125 0.25000624)
...
)
;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           nonuniform List<vector> 
9976
(
(-0.036678483 -0.10368386 0.012328394)
(-0.024670303 -0.107195 0.012349916)
(-0.028227799 -0.10625567 0.012159393)
(-0.017421318 -0.1067929 0.0099631684)
(-0.017333068 -0.10860029 0.012259375)
(-0.0075419338 -0.10753459 0.009998663)
(-0.0075443047 -0.1097393 0.01223239)
(0.0025345153 -0.10767739 0.0099999543)
...
)
;
    }
}


// ************************************************************************* //
