artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix_20260330_125208/cases/lumped_solid/0/jellyRoll/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
27144
(
7.9388526e-08
1.0146711e-07
1.071886e-07
9.6104353e-08
4.319774e-08
5.5969089e-08
1.3539356e-07
1.2365058e-07
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           uniform 0;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
