artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix_20260330_125208/cases/lumped_solid/system/samplePlanes
// -*- C++ -*-

samplePlanes
{
    type            surfaces;
    libs            (sampling);
    surfaceFormat   raw;
    writeControl    writeTime;
    fields          (T ecmQdot);

    surfaces
    {
        plane_x0
        {
            type    cuttingPlane;
            point   (0 0 0);
            normal  (1 0 0);
            offsets (0);
        }
    }
}

// ************************************************************************* //
