artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix_20260330_125208/cases/lumped_solid/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cellFull_2170.stl
    {
        type    triSurfaceMesh;
        name    externalWall;
    }
};

castellatedMeshControls
{
    maxLocalCells   200000;
    maxGlobalCells  2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 2;
    maxLoadUnbalance 0.1;
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle      30;

    features
    (
        {
            file "cellFull_2170.eMesh";
            level 1;
        }
    );

    refinementSurfaces
    {
        externalWall
        {
            level (1 1);
        }
    }

    refinementRegions
    {
    }

    locationsInMesh
    (
        (( 0 0 0.035 ) jellyRoll)
        (( 0.0100625 0 0.035 ) shell)
        (( 0 0 0.0653333 ) cap)
    );
}


snapControls
{
    tolerance       2;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap true;
    detectNearSurfacesSnap true;
    nSmoothPatch    3;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    nSmoothInternal 3;
    nFaceSplitInterval -1;
}


addLayersControls
{
    layers
    {
    }
    relativeSizes    true;
    expansionRatio    1.2;
    firstLayerThickness   0.1;
    featureAngle    85;
    slipFeatureAngle 30;
    nGrow           0;
    nBufferCellsNoExtrude 0;
    minMedialAxisAngle 90;
    maxFaceThicknessRatio 0.2;
    maxThicknessToMedialRatio 0.3;
    minThickness    1e-06;
    nLayerIter      50;
    nRelaxIter      5;
    nSmoothSurfaceNormals 10;
    nSmoothNormals  3;
    nSmoothThickness 10;
    nRelaxedIter    10;
    nMedialAxisIter 10;
}


meshQualityControls
{
    #include "meshQualityDict"
    nSmoothScale 4;
    errorReduction 0.75;
}


debug           0;

mergeTolerance  1e-08;

// ************************************************************************* //
