artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix_20260330_125208/cases/lumped_solid/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cellFull_2170.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeFeatureEdgeMesh    yes;
    writeObj                yes;
}


// ************************************************************************* //
